"""
Strings буюу тэмдэгт мөр
    Дараалласан тэмдэгтийн олонлогийг тэмдэгт мөр гэнэ.

String үүсгэх
    Дан болон давхар дусал дунд бичнэ.
"""

# Нэг үг
print('Сайн уу')
# Сайн уу


# Олон үг
print('Энэ бол олон үгээс бүрдсэн тэмдэгт мөр')
# Энэ бол олон үгээс бүрдсэн тэмдэгт мөр

# Коммент хэвлэх
a = """
Strings буюу тэмдэгт мөр
    Дараалласан тэмдэгтийн олонлогийг тэмдэгт мөр гэнэ.

String үүсгэх
    Дан болон давхар дусал дунд бичнэ.
"""
print(a)

# Давхар дусал
print("давхар дусал")
# давхар дусал


# Дусал дунд дуслыг шууд ашиглах боломжгүй.
"""
print(' Нэг дусал буюу ' - г дангаар нь ашиглах')
File "5. Python Strings.py", line 25
    print(' Нэг дусал буюу ' - г дангаар нь ашиглах')
                                 ^
SyntaxError: invalid syntax
"""


#"Нэг дусал буюу ' - дангаар нь ашиглах"
print("Нэг дусал буюу ' - дангаар нь ашиглах")
# Нэг дусал буюу ' - дангаар нь ашиглах
print('Нэг дусал буюу " - дангаар нь ашиглах')
# Нэг дусал буюу " - дангаар нь ашиглах


# ******************************************
# String хэвлэх
# print функцийг ашиглан тэмдэгтийг хэвлэнэ.

print('Сайн байна уу !')
print('Шинэ мөр авахдаа \n ашиглана')
print('\n')
print('Шинэ мөр')
"""
Сайн байна уу !
Шинэ мөр авахдаа 
 ашиглана


Шинэ мөр
"""

print('My name\'s Bat')
# My name's Bat
print("My name\'s Bat")
# My name's Bat


# ******************************************
# String Indexing
# [] ашиглан дэд тэмдэгт рүү хандана.

# s хувьсагчид оноох
s = 'Сайн байна уу!'
print(s)
# Сайн байна уу!
print("Эхний тэмдэгт:", s[0])
# С
print("3 дахь тэмдэгт:", s[2])
# й
print("7 дахь тэмдэгт:", s[6])
# а

# Тэмдэгт мөрийн 1-р элемэнтээс хойшхи бүх тэмдэгтийг авах
print("Тэмдэгт мөрийн 1-р элемэнтээс хойшхи бүх тэмдэгтийг авах:", s[1:])
# айн байна уу!

# Эхний 3 тэмдэгтийг авах
print("Эхний 3 тэмдэгтийг авах:", s[:3])
# Сай

# Бүх элемэнтийг авах
print("Бүх элемэнтийг авах:", s[:])
# Сайн байна уу!

# Сүүлийн тэмдэгтийг авах
print("Сүүлийн тэмдэгтийг авах:", s[-1])
# !

# Сүүлийн тэмдэгтээс бусад тэмдэгтийг авах
print("Сүүлийн тэмдэгтээс бусад тэмдэгтийг авах:", s[:-1])
# Сайн байна уу

# Эхний тэмдэгтээс , сүүлийн 2 дахь тэмдэгт хүртэл авах:
print("Эхний тэмдэгтээс , сүүлийн 2 дахь тэмдэгт хүртэл авах:", s[0:-2])
# Сайн байна у 

# 2 дахь тэмдэгтээс, сүүлийн нэг тэмдэгт хүртэл авах:
print("2 дахь тэмдэгтээс, сүүлийн нэг тэмдэгт хүртэл авах:", s[1:-1])
# айн байна уу

# Сүүлийн 4 дахь тэмдгээс сүүлийн 2 дахь тэмдэгт хүртэл авах
print("Сүүлийн 4 дахь тэмдгээс сүүлийн 2 дахь тэмдэгт хүртэл авах:", s[-5:-2])
# а у


# [start:end:step]
# 0, 1, 2, 3 ... 
# start хэддүгээр индекс ээс эхлэх ээ, 1 гэвэл 1 ороод 1 ээс эхлэнэ
# stop хэддүгээр индекс хүртэл явах аа, 5 гэвэл 5 орохгүй 5 хүртэл  
# step нь хэд дэхь дэмтэгтийг алгасах вэ, 2 гэвэл дандаа 2 дахь тэмдэгтийг алгасах

# Эхний тэмдэгтээс эхлээд 6 дахь дэмтэгтийг алгасахгүй авах
print("Эхний тэмдэгтээс эхлээд 6 дахь дэмтэгтийг алгасахгүй авах:", s[0:7:1])
# Сайн ба

# 2 дахь тэмдэгтээс эхлээд 5 дахь дэмтэгтийг авах
print("2 дахь тэмдэгтээс эхлээд 5 дахь дэмтэгтийг авах:", s[1:6])
# айн б

# 2 дахь  тэмдэгтээс эхлээд 5 дахь дэмтэгтийн, 2 дахь тэмдэгтүүдийг алгасах
print("2 дахь тэмдэгтээс эхлээд 5 дахь дэмтэгтийн, 2 дахь тэмдэгтүүдийг алгасах:", s[1:6:2])
# анб

# print("---------------------------------------------------", s[1:6:0])
# ValueError: slice step cannot be zero


# 1 тэмдэгт бүрээр гүйж авах
print("1 тэмдэгт бүрээр гүйж авах:", s[::1])
# Сайн байна уу!

# 1 тэмдэгт бүрийг алгасах
print("1 тэмдэгт бүрийг алгасах:", s[::2])
# Сй ан у

# 2 тэмдэгт бүрийг алгасах
print("2 тэмдэгт бүрийг алгасах:", s[::3])
# Снаау

# Тэмдэгтийн араас алгасах
print("Тэмдэгтийн араас алгасах:", s[::-1])
# !уу анйаб нйаС

# 1 тэмдэгт ээр араас алгасах
print("1 тэмдэгт ээр араас алгасах:", s[::-2])
# !уайбна

# 2 тэмдэгт ээр араас алгасах
print("2 тэмдэгт ээр араас алгасах:", s[::-3])
# ! й а

# Эхний тэмдэгтийг авахгүй
print("Эхний тэмдэгтийг авахгүй:", s[1::1])
# айн байна уу!

# Эхний 2 тэмдэгтийг авахгүй
print("Эхний 2 тэмдэгтийг авахгүй:", s[2::1])
# йн байна уу!

# Эхний тэмдэгтийг авахгүй мөн 1 тэмдэгт бүрийг алгасах
print("Эхний тэмдэгтийг авахгүй мөн 1 тэмдэгт бүрийг алгасах:", s[1::2])
# анбйау!

tt = 'abcdefgh'
# 
print("----------------------------------------------------:", tt[1::-1])
# ba
print("----------------------------------------------------:", tt[1::-2])
# b
print("----------------------------------------------------:", tt[6::-4])
# gc



"""
String - ийн үндсэн функцууд
    Python хэл дэхь обьектууд өөрсдийн үндсэн функцуудтай байдаг. Дараах байдлаар дуудна.
    object.method(parameters)
    Эдгээрийг илүү гүнзгийрүүлж үзэх болно.
"""

print(s)
# Сайн байна уу!

# Тэмдэгтийн уртыг олох
print("Тэмдэгтийн урт:", len(s))
# 14

# Томруулах
print("Томруулах:", s.upper())
# САЙН БАЙНА УУ!

# Жижигрүүлэх
print("Жижигрүүлэх:", s.lower())
# сайн байна уу!

# Тэмдэгтийг задлах
print("Тэмдэгтийг задлах:", s.split(' '))
# ['Сайн', 'байна', 'уу!']

# Тэмдэгтээр задлах
print("'ай' тэмдэгтийг задлах:", s.split('ай'))
# ['С', 'н б', 'на уу!']

# Тэмдэгтийг хооронд нь солих
print("Тэмдэгтийг хооронд нь солих:", s.replace("С", "К"))
# Кайн байна уу!


st = " үндсэн функцууд   "
print(st)
#  үндсэн функцууд   

# Хоосон зайг хасна
print("Хоосон зайг хасна:", st.strip())
# үндсэн функцууд

# Тухайн тэмдэгт байна уу гэж шалгах
check = "Сайн" in s
print("Тухайн тэмдэгт байна уу гэж шалгах:", check)
# true
check = "Сайн уу" in s
print("Тухайн тэмдэгт байна уу гэж шалгах:", check)
# false
# Тухайн тэмдэгт байхгүй байна уу гэж шалгах
check = "Сайн" not in s
print("Тухайн тэмдэгт байхгүй байна уу гэж шалгах:", check)
# false
check = "Сайн уу" not in s
print("Тухайн тэмдэгт байхгүй байна уу гэж шалгах:", check)
# true
