
"""
Python Arithmetic Operators::

+----------+----------------+--------+
| Оператор |     Тайлбар    |  Жишээ |
+----------+----------------+--------+
|     +    |      Нэмэх     |  x + y |
+----------+----------------+--------+
|     -    |      Хасах     |  x - y |
+----------+----------------+--------+
|     *    |      Үржих     |  x * y |
+----------+----------------+--------+
|     /    |     Хуваах     |  x / y |
+----------+----------------+--------+
|     %    |     Модуль     |  x % y |
+----------+----------------+--------+
|    **    |   Тоон зэрэг   | x ** y |
+----------+----------------+--------+
|    //    | Бүхлээр хуваах | x // y |
+----------+----------------+--------+

"""

# Нэмэх
print(1+2) 
# 3

# Хасах
print(10-8) 
# 2

# Үржих
print(5*6)
# 30

# Хуваах
print(5/2)
# 2.5

# Бүхлээр хуваах - Floor division
print(5//2)
# 2

# Хуваасан үлдэгдэл - Division reminder
print(5%2)
# 1

# Тоон зэрэг - Powers
print(2**3)
# 8 

# Язгуур олох 
print(4**0.5)
#2

"""
Python Assignment Operators::

+--------------+--------------+--------------+
|   Оператор   |            Жишээ:           |
+--------------+--------------+--------------+
|       =      |     x = 1    |     x = 1    |
+--------------+--------------+--------------+
|      +=      |    x += 8    |   x = x + 8  |
+--------------+--------------+--------------+
|      -=      |    x -= 8    |   x = x - 8  |
+--------------+--------------+--------------+
|      *=      |    x *= 8    |   x = x * 8  |
+--------------+--------------+--------------+
|      /=      |    x /= 8    |   x = x / 8  |
+--------------+--------------+--------------+
|      %=      |    x %= 8    |   x = x % 8  |
+--------------+--------------+--------------+
|      //=     |    x //= 8   |  x = x // 8  |
+--------------+--------------+--------------+
|      **=     |    x **= 8   |  x = x ** 8  |
+--------------+--------------+--------------+

"""

a = 5
print(a)
# 5

a += 10     # a = a + 10
print(a)
# 15

a -= 3     # a = a - 3
print(a)
# 12

a *= 6      # a = a * 6  
print(a)
# 72

a /= 2      # a = a / 2  
print(a)
# 36

a //= 5      # a = a // 5  
print(a)
# 7

a %= 4      # a = a % 4  
print(a)
# 3

a **= 2      # a = a ** 2  
print(a)
# 9

"""
Operators::
Comparison Operators буюу харьцуулах оператор

a = 10, b = 20 гэж үзье.

+----------+--------------------------------------------------------+----------------------+
| Оператор |                         Тайлбар                        |         Жишээ        |
+----------+--------------------------------------------------------+----------------------+
|    ==    | Утгууд тэнцүү бол True буцаана.                        |   (a == b) нь False. |
+----------+--------------------------------------------------------+----------------------+
|    !=    | Утгууд ялгаатай бол True буцаана.                      |   (a != b) нь True.  |
+----------+--------------------------------------------------------+----------------------+
|     >    | Зүүн утга баруунаас их бол True буцаана.               |   (a > b) нь False.  |
+----------+--------------------------------------------------------+----------------------+
|     <    | Зүүн утга баруунаас бага бол True буцаана.             |    (a < b) нь True.  |
+----------+--------------------------------------------------------+----------------------+
|    >=    | Зүүн утга баруунаас их буюу тэнцүү бол True буцаана.   |  (a >= b) нь False.  |
+----------+--------------------------------------------------------+----------------------+
|    <=    | Зүүн утга баруунаас бага буюу тэнцүү бол True буцаана. |   (a <= b) нь True.  |
+----------+--------------------------------------------------------+----------------------+

"""
a = 10
b = 20
c = 10
print(f"a = {a}, b = {b}, c = {c}")
print("a == c", a == c)
# True
print("a == b", a == b)
# False
print("a != b", a != b)
# True
print("a != c", a != c)
# False
print("a > b", a > b)
# False
print("a < b", a < b)
# True
print("c >= a", c >= a)
# True
print("c >= b", c >= b)
# False
print("c <= b", c <= b)
# True

"""
Logical Operators::

x = True, y = False гэж үзье.

+----------+-------------------------------------+-------------------------+
| Оператор |               Тайлбар               |          Жишээ          |
+----------+-------------------------------------+-------------------------+
|    and   | Бүгд True бол True буцаана.         |    (x and y) нь False.  |
+----------+-------------------------------------+-------------------------+
|    or    | Аль нэг нь True бол True буцаана.   |    (x or y) нь True.    |
+----------+-------------------------------------+-------------------------+
|    not   | Худлаа гэдэг нь үнэн үү гэж асууна. |  not (x and y) нь True. |
+----------+-------------------------------------+-------------------------+

"""
x = True
y = False
z = True
q = False
print(f"x = {x}, y = {y}, z = {z} , q = {q}")
print("x and y::", x and y)
# False
print("x and z::", x and z)
# True
print("x or y::", x or y)
# True
print("q or y::", q or y)
# False
print("not(x and y)::", not(x and y))
# True

print("10 > 8 and 20 < 15:: ", 10 > 8 and 20 < 15)
# False
print('10 > 8 and "true" == "true" and 20 > 15:: ', 10 > 8 and "true" == "true" and 20 > 15)
# True
print("not 100 > 50:: ", not 100 > 50)
# False

"""
Python Identity Operators::

+----------+--------------------------------------------------------+-------------+
| Оператор |                           Тайлбар                      |     Жишээ   |
+----------+--------------------------------------------------------+-------------+
|    is    |   Хоёр хувьсагч адилхан объект байвал "true" буцаана   |    x is y   |
+----------+--------------------------------------------------------+-------------+
|  is not  | Хоёр хувьсагч адилхан объект биш байвал "true" буцаана |  x is not y |
+----------+--------------------------------------------------------+-------------+

"""

x = 0
y = 1
print(f"x = {x}, y = {y}")
# x = 0, y = 1
print("x is y:: ", x is y)
# False
print("x is not y:: ", x is not y)
# True

x = "xy"
y = "xy"
print(f"x = {x}, y = {y}")
# x = xy, y = xy
print("x is y:: ", x is y)
# True
print("x is not y:: ", x is not y)
# False

"""
Python Membership Operators::

+----------+-----------------------------------------------------+-------------+
| Оператор |                         Тайлбар                     |     Жишээ   |
+----------+-----------------------------------------------------+-------------+
|    in    |     Объектид тухайн утга байвал "True" буцаана.     |    x in y   |
+----------+-----------------------------------------------------+-------------+
|  not in  | Объектид тухайн утга байхгүй байвал "True" буцаана. |  x not in y |
+----------+-----------------------------------------------------+-------------+

"""
# s хувьсагчид оноох
s = 'Сайн байна уу!'
# Тухайн тэмдэгт байна уу гэж шалгах
check = "Сайн" in s
print("Тухайн тэмдэгт байна уу гэж шалгах:", check)
# true
check = "Сайн уу" in s
print("Тухайн тэмдэгт байна уу гэж шалгах:", check)
# false
# Тухайн тэмдэгт байхгүй байна уу гэж шалгах
check = "Сайн" not in s
print("Тухайн тэмдэгт байхгүй байна уу гэж шалгах:", check)
# false
check = "Сайн уу" not in s
print("Тухайн тэмдэгт байхгүй байна уу гэж шалгах:", check)
# true






